{
	"programs":[
				{"code":"WEB110","name":"HTML & CSS","content":"This course is designed to provide students with an introduction to the techniques that are used to create content for the web. Students will develop a good understanding of HTML with an introduction to CSS. Topics include: Web design considerations, working with text, images, links, navigation, using tables for tabular data, the use of multimedia in web pages, and CSS to control presentation."},
				{"code":"MAD102","name":"Introduction to Programming","content":"This course is designed to introduce the student to general computer concepts and the programming process. Students will study the fundamental concepts of how computers operate and process instructions. Emphasis is placed on basic programming logic. Using a modern programming language, students will practice the construction of programming algorithms that utilize basic control structures, data structures and functions."},
                {"code":"MIT153","name":"Introductory Programming Logic","content":"In this hands-on course, students will learn the basics of drawing, image manipulation and enhancement capabilities and modify digital images and illustrations using the drawing and editing tools of a popular digital and photo editing software products."},
                {"code":"MAD101","name":"Working with Graphics","content":"In this hands-on course, students will learn the basics of drawing, image manipulation and enhancement capabilities and modify digital images and illustrations using the drawing and editing tools of a popular digital and photo editing software products."},
                {"code":"MAD100","name":"Java Programming I","content":"This course introduces students to the fundamental programming concepts using the Java language. Students will learn the proper use of control structures such as selection, looping and modularization. They will also become proficient at using the basic Java syntax to implement program designs. Students will learn how a language such as Java handles various primitive data types and how standard classes are used to support the storage and manipulation of more complex data. Students will be introduced to “Encapsulation”, the first concept of Object Oriented Programming (OOP)."},
                {"code":"MAD103","name":"Data Fundamentals","content":"This course is designed to introduce the student to data representation storage and transmission as used in mobile web and mobile application development. Topics covered will methods for storing and exchanging text information; SQL (Structured Query Language) emphasizing data retrieval queries and database design methodologies."},
                {"code":"ELEC1030","name":"Choose one General Education Elective","content":"Choose one General Education Elective"},
                {"code":"WEB205","name":"PHP Basics","content":"This course builds on a student's programming skills by introducing them to the PHP language. PHP (Hypertext Preprocessor) is a cross-platform scripting language that is particularly well-suited for web development. This course will introduce students to the PHP language, while writing basic PHP programs. Focus is placed on language syntax and data structures, flow control syntax, built-in functions, and best practices."},
                {"code":"WEB210","name":"Web Design / CSS","content":"Students learn principles of sound web design, planning site layout and navigation. An introduction to HTML5, CSS3, CSS page layout, and optimizing for printing using standards-based design that is portable across browsers and devices is also provided."},
                {"code":"WEB230","name":"Javascript I","content":"This course introduces the student to the creation of dynamic Web pages using the popular Web scripting language, JavaScript! This course is perfect for beginning programmers with prior knowledge of HTML. Students will be introduced to Object-Oriented JavaScript and the debugging of JavaScript code."},
                {"code":"MAD200","name":"Java Programming II","content":"This course builds upon the fundamental programming knowledge learned in Java Programming 1. The student’s knowledge of Object Oriented Programming (OOP) will be expanded to include the concepts of Inheritance and Polymorphism that are used extensively in modern software development. Students will become proficient in implementing these concepts in Java interface in intermediate event driven graphical user interface development."},
                {"code":"MAD205","name":"Android Development I","content":"This course is designed to introduce students to beginner application development for the Android operating system (OS) utilizing intermediate object oriented programming (OOP) in Java and XML. Students will study the history and components of the Android operating system and its applications. Furthermore students will study the process and application life cycle of Android applications. Students will learn to become proficient with integrated development environments (IDE’s) and how they can be used to create and manage applications. Students will also study many dynamics of the Android OS such as OS distribution, market share, and application feature compatibility."},
                {"code":"MIT201","name":"Law & Ethics in the Digital Age","content":"This course prepares students to consider the legal and ethical challenges they may come across as computer-based technology professionals in the rapidly and continuously evolving digital era. They will examine the nature of intellectual property and legislative developments that have occurred in response technological advancements. Students will explore legal and ethical issues as they relate to the ownership, control, accuracy, privacy, collection, use, access and security of data"},
                {"code":"MAD303","name":"Web Applications with PHP and MYSQL","content":"This course will help PHP developers refine their server-side web application development skills. Focus will be placed on creating a number of complete database-driven sites using PHP and MySQL."},
                {"code":"MAD304","name":"Object-Oriented Analysis and Design","content":"This OOA&D course presents the key concepts and methodologies required to perform object-oriented software design, with particular attention to practical techniques such as use-cases, and UML diagramming. Students practice applying object oriented analysis during the course to improve software designs and to see how software objects can be altered to build robust software systems. The Unified Modeling Language (UML) is presented in detail and is used in the exercises and case studies. Practical aspects of project management and implementation are also presented."},
                {"code":"MAD300","name":"Java Programming III","content":"In this course, students build programs collaboratively with other students in the class. This course builds upon the intermediate level programming knowledge learned in Java Programming 2. The student’s knowledge of Object Oriented Programming (OOP) will be expanded to include the use of JavaFX, multi-threading, Network connections, databases and version control."},
                {"code":"MAD305","name":"Android Development II","content":"This course introduces students to intermediate mobile applications for the Android operating system (OS) utilizing intermediate object oriented programming (OOP) in Java and XML. Students learn to add diagnostic and debugging features to their applications and to utilize different layout designs for their android applications. Students will also study different methods of representing large amounts of data on the screen."},
                {"code":"MAD310","name":"iOS Development I","content":"This course is designed to introduce the student to Swift and the programming process for developing applications for the iOS environment. Students will study the the basic syntax of Swift including collections, functions, enumerations, structures and classes . The course will cover Apple’s development environment, Xcode, and navigating support documentation. Apple’s Foundation classes will be covered leading into development for the iOS platform. This course assumes a strong grasp of programming concepts in another language."},
                {"code":"MAD400","name":"Frameworks","content":""},
                {"code":"MAD403","name":"Advanced Web Applications with PHP and MYSQL","content":"This course will help reinforce object oriented best practices through a series of projects and small assignments. Focus will be placed on advanced object oriented techniques, PHP constructs and built-in functions."},
                {"code":"MAD402","name":"UI Fundamentals","content":"This course helps students gain a solid understanding of modern user interface design principles. The foundations of user interface design are presented in a way that is relevant to current software application development practices. Students will be introduced to standards relating to native operating system design standards, interaction design, and mobile user experience. Students will use industry standard tools to create wireframes, rapid-development prototypes and development ready user interface designs."},
                {"code":"MAD401","name":"C# Programming","content":"This course is designed to introduce students to the C# programming language and it’s use in developing rich graphical user interface applications. Through the creation of practical applications, students will learn topics such as input/output, object-oriented programming, unit testing, GUI design and development, persistent storage and the .NET framework’s family of collections."},
                {"code":"MAD405","name":"Android Development III","content":"This course enables the student developer to design and create data-centric mobile applications on Google’s Android platform. Students will look at local data storage methods, focusing on writing SQLite databases for applications, and look at ways to bind these databases to user interfaces. The use of API’s and how they can enrich the content of apps will also be explored."},
                {"code":"MAD410","name":"iOS Development II","content":"This course expands essential concepts, tools, and techniques for developing iOS applications. Swift is implemented to create iOS apps using Apple’s iOS APIs. Proficiency at searching and applying Apple’s reference documentation will be developed. Techniques of memory management, delegation, using location and the camera, displaying information and accepting input from the user will be developed."},
                {"code":"MAD500","name":"Designing Web Sites for Mobile","content":"This course will examine the business factors that drive design and development decisions and the effect these decisions have on deciding when and how to create mobile web sites. Students will be able to evaluate different approaches to composing mobile web sites and be able to assemble a strategy for doing so. By the end of the course, students will be able to formulate solutions to both simple and complex design problems, communicate effectively with non-technical stakeholders, and analyze, uncover, and integrate insights from data to improve the effectiveness of a mobile site."},
                {"code":"MAD501","name":"Agile Project Management","content":"Students in the project management course will learn to apply Agile project management techniques relevant to web development projects. Exposure to iterative, incremental method of managing the design and build activities of information technology and other business areas that aim to provide new product or service development in a highly flexible and interactive manner."},
                {"code":"MAD506","name":"Fundamentals of Game Development I","content":"This course is designed to introduce students to professional game design and development. Students will learn to develop games using an industry leading game engine and the C# programming language. Through a series of practical project based assignments, students will learn topics such as game prototyping and mechanics, iterative game development and game components including physics, collision handling and basic artificial intelligence."},
                {"code":"MAD502","name":"Portfolio Development","content":"The career portfolio development process gives the student the essential tool that can help communicate and demonstrate their knowledge, skills, and abilities. Students will collect and document skills learned in their college program and in life, providing evidence and proof of these skills in a professional-looking web-based portfolio. This course is intended to assist students in gaining a greater self-awareness of the value of preparing a personal portfolio for employment, promotions, and further educational studies."},
                {"code":"MAD503","name":"Portfolio Development","content":"The career portfolio development process gives the student the essential tool that can help communicate and demonstrate their knowledge, skills, and abilities. Students will collect and document skills learned in their college program and in life, providing evidence and proof of these skills in a professional-looking web-based portfolio. This course is intended to assist students in gaining a greater self-awareness of the value of preparing a personal portfolio for employment, promotions, and further educational studies."},
                {"code":"MAD510","name":"iOS Advanced Development III","content":"This course is a continuation of iOS development 2. Students will build on existing iOS skills and implement local storage using Core Data. Students will design and build applications that use advanced iOS frameworks, and that integrate app extensions and voice assistance. Students will also explore techniques for quality testing of applications and the steps necessary for submission to the iOS App Store."},
                {"code":"MAD512","name":"Cross Platform Development","content":""},
                {"code":"WEB615","name":"New Technologies and Trends","content":"This course introduces the student to emerging issues and leading technologies in Information and Communication Technology. Emphasis will be on how these technologies impact information systems, users, the Information Technology labour force and society. Analysis and forecasting of technology trends will be considered as well."},
                {"code":"MAD602","name":"Mobile Application Project","content":""},
                {"code":"MAD601","name":"Mobile Application Project","content":"The final mobile application project is the culmination of the student’s work in this program. The goal is to produce a well-designed, functional application. Working in small groups, the team will make a series of presentations as they progress through the application development life cycle."},
                {"code":"MAD606","name":"Fundamentals of Game Development II","content":"This course expands upon the knowledge gained in Fundamentals of Game Development 1 by introducing students to advanced game design and development topics. Topics include advanced game mechanics, artificial intelligence, virtual reality, multi-platform application deployment and asset creation.\nStudents will gain practical experience by applying their knowledge to a complete set of project-based assignments and self-contained exercises."},
                {"code":"ENT500","name":"Entrepreneurship ","content":"Entrepreneurs play a key role in the Canadian economy. This course is an introduction to provide students with the basic knowledge required to plan, start, and manage a small business or some form of self-employment. It presents actual skills that students will use throughout their working\nlives. It will provide knowledge and skills through many practical applications for both employment situations (small businesses) and personal financial management."}
	]
}